tutorials/incompressibleVoF/containerDischarge2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.liquid 0;
}

zones
{
    liquid
    {
        type        box;

        box         (-100 -100 0.0) (100 100 0.05);

        values
        {
            alpha.liquid 1;
        }
    }
}

// ************************************************************************* //
